In [1]:
import pandas as pd

In [2]:
import sqlite3

In [3]:
import os

In [4]:
db = sqlite3.connect("cars.db")

In [7]:
df = pd.read_csv(r"cars.csv",header=1)

In [8]:
df.to_sql("cars", db, if_exists="replace")
def run_query(query):
    return pd.read_sql_query(query,db)
os.getcwd

In [9]:
query = """
SELECT *
FROM sqlite_master
ORDER BY name;
"""
run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,cars,cars,2,"CREATE TABLE ""cars"" (\n""index"" INTEGER,\n ""SS..."
1,index,ix_cars_index,cars,3,"CREATE INDEX ""ix_cars_index""ON ""cars"" (""index"")"

In [10]:
query = """
SELECT *
FROM cars;
"""
run_query(query)

   index  SSD   Premio  1800
0      0  KCN  Fielder  1500
1      1  USG     Benz  2200
2      2  TCH      BMW  2000
3      3  KBQ    Range  3500
4      4  TBD   Premio  1800
5      5  KCP     Benz  2200
6      6  USD  Fielder  1500
7      7  UGB      BMW  2000
8      8  TBG    Range  3200